#+TAGS: ENGLISH(e) FINNISH(f)

*** Finnishpod101 ABS1L8                                            :FINNISH:

    - Dialog

      J: Tiedätkö, missä sininen mukini on?

      H: Se on keittiössä.

      J: Missä päin?

      H: Kuivauskaapissa.

      J: Siinähän se on. Kiitos.

      H: Eipä kestä.

    - Vocabulary

      | Finnish               | English                    | Class  |
      |-----------------------+----------------------------+--------|
      | eipä kestä            | you're welcome             | phrase |
      | siinä                 | there                      | adverb |
      | kaappi                | cabinet                    | noun   |
      | (astian)kuivauskaappi | (dish) drying cabinet      | noun   |
      | päin                  | in the approximate area of | adverb |
      | sininen               | blue                       | adj    |
      | muki                  | mug                        | n      |
      | tietää                | to known                   | v      |
      | missä                 | where                      | adv    |
      | keittiö               | kitchen                    | n      | 

    - Sample sentences

      | Finnish                            | English                              |
      | Eipä kestä, ei siitä ollut vaivaa. | Don't mention it, it was no trouble. |
      | Siinä se on.                       | There it is.                         |
      | Kuivauskaappi on täynnä.           | The drying cabinet is full.          |
      | Missä päin asut?                   | Whereabouts do you live?             |
      | Taivas on sininen.                 | The sky is blue.                     |
      | Muki on kaapissa.                  | The mug is in the cabinet.           |
      | Missä olet?                        | Where are you?                       |
      | Missä on johtaja?                  | Where is the boss?                   | 

    - Grammer

      - Words with only one stem

        | Nominative | Partitive  | Inessive          | English     |
        |------------+------------+-------------------+-------------|
        | päivä      | päivä-ä    | päivä-ssä         | day         |
        | hyvä       | hyvä-ä     | hyvä-ssä          | good        |
        | minä       | minu-a     | minu-ssa          | I           |
        | hauska     | hauska-a   | hauska-ssa        | fun, nice   |
        | terve      | terve-ttä  | tervee-ssä        | healthy     |
        | sinä       | sinu-a     | sinu-ssa          | you         |
        | mikä       | mi-tä      | mi-ssä            | what, which |
        | tämä       | tä-tä      | tä-ssä            | this        |
        | se         | si-tä      | sii-nä(irregular) | it          |
        | tuo        | tuo-ta     | tuo-ssa           | that        |
        | lasi       | lasi-a     | lasi-ssa          | glass       |
        | suola      | suola-a    | suola-ssa         | salt        |
        | sokeri     | sokeri-a   | sokeri-ssa        | sugar       |
        | tee        | tee-tä     | tee-ssä           | tea         |
        | itse       | itse-ä     | itse-ssä          | self        |
        | koulu      | koulu-a    | koulu-ssa         | school      |
        | maito      | maito-a    | maido-ssa         | milk        |
        | salaatti   | salaatti-a | salaati-ssa       | salad       |
        | omena      | omena-a    | omena-ssa         | apple       |
        | päärynä    | päärynä-ä  | päärynä-ssä       | pear        |
        | piirakka   | piirakka-a | piiraka-ssa       | pie         |
        | mustikka   | mustikka-a | mustika-ssa       | blueberry   |
        | vihreä     | vihreä-ä   | vihreä-ssä        | green       |
        | musta      | musta-a    | musta-ssa         | black       |
        | kahvi      | kahvi-a    | kahvi-ssa         | coffee      |
        | muki       | muki-a     | muki-ssa          | cup         |
        | keittiö    | keittiö-tä | keittiö-ssä       | kitchen     |
        | kaappi     | kaappi-a   | kaapi-ssa         | cupboard    |
        |            |            |                   |             |

      - Words with two stems

	  | Nominative  | Partitive    | Inessive       | English   |
	  |-------------+--------------+----------------+-----------|
	  | väsynyt     | väsynyt-tä   | väsynee-ssä    | tired     |
	  | hän         | hän-tä       | häne-ssä       | he/she    |
	  | lautanen    | lautas-ta    | lautase-ssa    | plate     |
	  | kuka        | ke-tä        | kene-ssä       | who       |
	  | kiitos      | kiitos-ta    | kiitokse-ssa   | thank     |
	  | herkullinen | herkullis-ta | herkullise-ssa | delicious |
	  | sininen     | sinis-tä     | sinise-ssä     | blue      | 

    - Usage

	  The basic meaning of the inessive is "in"; that is, you are saying that there is something inside the thing that is in the inessive case.
	 
	  For example:
	 
    1. Lasi on kaapissa.
       "/The glass is in the cabinet./"

    2. Mitä tuossa sinisessä mukissa on?
       "/What's in that blue mug?/"

    3. Tässä piirakassa on omenaa ja päärynää.
       "/There's apple and pear in this pie./"

    4. Missä kaapissa lautanen on?
       "/Which cabinet is the plate in?/"

	  Vague locative meaning. Used with month names to indicate that an action takes place during that month, or something takes place at regular intervals.
	 
	  For example:
	 
    1. Liisa on puhelimessa.
       "/Liisa is on the phone./"

    2. Minussa ei ole mitään vikaa.
       "/There's nothing wrong with me./"

    3. Heinäkuussa poimin mustikoita.
       "/In July, I pick blueberries./"

    4. Omena päivässä pitää lääkärin loitolla.
       "/An apple a day keeps the doctor away./"

	  Ongoing action.

	  For example:

    1. Olen juuri syömässä.
       "/I am eating just now./"

    2. Olen jo menossa.
       "/I am on my way./"

	  Lastly, it can be found in certain expressions of state.
	 
	  For example:

    1. Leipä on homeessa. (home = "mould")
       "/The bread is mouldy./"

    2. Ville on humalassa. (humala = "state of drunkenness")
       "/Ville is drunk./"

       :LOGBOOK:
       CLOCK: [2015-09-18 Fri 21:26]--[2015-09-18 Fri 21:37] =>  0:11
       :END:
    [2015-09-18 Fri 21:26]

*** Vectors as Stacks
    #+BEGIN_SRC clojure
      (def stack [1 2 3 4])
      (peek stack)   ;; peek
      (pop stack)    ;; pop
      (conj stack 5) ;; push
    #+END_SRC

    #+BEGIN_SRC clojure
      (defn my-map [f coll]
        (loop [coll coll acc []]
          (if (empty? coll)
            acc
            (recur (next coll)
                   (conj acc (f (first coll)))))))
      (my-map #(+ % 1) [1 2 3 4])
    #+END_SRC


    #+RESULTS:
    : #'user/my-map[2 3 4 5]
*** Finding positions of items in a sequence
    #+BEGIN_SRC clojure
      (defn index [coll]
        (cond
          (map? coll) (seq coll)
          (set? coll) (map vector coll coll)
          :else (map vector (iterate inc 0) coll)))

      (defn pos [pred coll]
        (for [[i v] (index coll) :when (pred v)] i))
      (pos #(= % 3) [1 4 5 6 3 2 5 3 9 8 3])
      (pos #(= % 4) {:a 1 :b 2 :c 3 :d 4})
      (pos #(= % :k) #{:a :b :k :e})
    #+END_SRC

    #+RESULTS:
    : #'user/index#'user/pos(4 7 10)(:d)(:k)


    * Books
*** Higher Order Functions
    #+BEGIN_SRC clojure
      (def plays [{:band "Burial" :plays 979 :loved 9}
                  {:band "Eno" :plays 2333 :loved 15}
                  {:band "Bill Evans" :plays 979 :loved 9}
                  {:band "Magma" :plays 2665 :loved 31}])

    #+END_SRC

    #+RESULTS:
    : #'user/plays

    Sort by plays / loved ratio

    #+BEGIN_SRC clojure
      (sort-by #(/ (:plays %) (:loved %)) plays)
    #+END_SRC

    #+RESULTS:
    | :band | Magma      | :plays | 2665 | :loved | 31 |
    | :band | Burial     | :plays |  979 | :loved |  9 |
    | :band | Bill Evans | :plays |  979 | :loved |  9 |
    | :band | Eno        | :plays | 2333 | :loved | 15 |

*** Higher order function
    Function type:
    #+BEGIN_SRC kotlin
      val sum: (Int, Int) -> Int = { a, b -> a + b }
      val action: () -> Unit = { println("hello") }
      action.invoke()
      sum(1, 2)
    #+END_SRC

    #+RESULTS:
    : hello
    : res0: kotlin.Int = 3
    : res1: kotlin.String = >>>                                                                                                                                 
    
    Passing function into function:
    #+BEGIN_SRC kotlin :results output
      fun String.filter(predicate: (Char) -> Boolean): String {
          val sb = StringBuilder()
          for (index in 0 until length) {
              val element = get(index)
              if (predicate(element)) sb.append(element)
          }
          return sb.toString()
      }
      println("ab1c".filter { it in 'a'..'z'})
    #+END_SRC

    #+RESULTS:
    : abc
    : res23: kotlin.String = >>> 
    
    Original version of =joinToString=:
    #+BEGIN_SRC kotlin
      fun <T> Collection<T>.joinToString(
          separator: String = ", ",
          prefix: String = "",
          postfix: String = ""
      ): String {
          val result = StringBuilder(prefix)
          for ((index, element) in this.withIndex()) {
              if (index > 0) result.append(separator)
              result.append(element)
          }
          result.append(postfix)
          return result.toString()
      }
      listOf(1, 2, 3).joinToString()
    #+END_SRC

    #+RESULTS:
    : res26: kotlin.String = 1, 2, 3
    : res27: kotlin.String = >>> 

    Version that controls how to convert each element to String:
    #+BEGIN_SRC kotlin
      fun <T> Collection<T>.joinToString(
          separator: String = ", ",
          prefix: String = "",
          postfix: String = "",
          transform: (T) -> String = { it.toString() }
      ): String {
          val result = StringBuilder(prefix)
          for ((index, element) in this.withIndex()) {
              if (index > 0) result.append(separator)
              result.append(transform(element))
          }
          result.append(postfix)
          return result.toString()
      }
      listOf(1, 2, 3).joinToString(transform={ "$it*" })
    #+END_SRC

    #+RESULTS:
    : res28: kotlin.String = 1*, 2*, 3*
    : res29: kotlin.String = >>> 
*** DSL
    #+BEGIN_SRC kotlin
      import java.time.*

      enum class Tense {
          AGO, FROM_NOW
      }

      infix fun Int.days(tense: Tense): LocalDateTime {
          return when(tense) {
              Tense.AGO -> LocalDateTime.now().minusDays(this.toLong())
              Tense.FROM_NOW -> LocalDateTime.now().plusDays(this.toLong())
              else -> LocalDateTime.now()
          }
      }

      println(2 days Tense.AGO)
      println(2 days Tense.FROM_NOW)
    #+END_SRC

    #+RESULTS:
    : 2020-06-25T16:04:21.315
    : 2020-06-29T16:04:21.315
    : res25: kotlin.String = >>> 


    #+BEGIN_SRC kotlin
      fun call(greet: String.(String) -> Unit) {
          "hello".greet("Guowei")
      }

      call { name -> println("$this $name") }
    #+END_SRC

    #+RESULTS:
    : hello Guowei
    : res3: kotlin.String = >>> 

    #+BEGIN_SRC kotlin
      "planning" meeting {
          start at 3..15
      }

      class Meeting(val name: String) {
          val start = this

          infix fun at(time: IntRange) {
              println("Starts at $time")
          }
      }

      infix fun String.meeting(block: Meeting.() -> Unit): Meeting {
          val meeting = Meeting(this)
          meeting.block()
          return meeting
      }
    #+END_SRC

    #+RESULTS:
    : res7: kotlin.String = >>> 

    #+BEGIN_SRC kotlin
      class Robot {
          val left = "left"
          val right = "right"
          val fast = "fast"

          infix fun turns(direction: String) {
              println("Turns $direction")
          }

          infix fun runs(speed: String) {
              println("Runs $speed")
          }
      }

      fun operate(block: Robot.(Robot) -> Unit) {
          val robot = Robot()
          robot.block(robot)
      }

      operate {
          it turns left
          it turns right
          it runs fast
      }

    #+END_SRC

    #+RESULTS:
    : Turns left
    : Turns right
    : Runs fast
    : res3: kotlin.String = >>> 

*** DSL Builder
    #+BEGIN_SRC kotlin
      @DslMarker annotation class PersonDSL


      data class Person(val name: String, val age: Int, val address: Address)
      data class Address(val postalCode: String, val city: String, val street: String)

      @PersonDSL
      class AddressBuilder {
          private var postalCode = ""
          private var city = ""
          private var street = ""

          fun postalCode(block: () -> String) {
              this.postalCode = block()
          }

          fun city(block: () -> String) {
              this.city = block()
          }

          fun street(block: () -> String) {
              this.street = block()
          }

          fun build(): Address {
              return Address(postalCode, city, street)
          }
      }

      fun address(block: AddressBuilder.() -> Unit): Address {
          return AddressBuilder().apply(block).build()
      }

      @PersonDSL
      class PersonBuilder {
          private var name = ""
          private var age = 0;
          private var address = Address("", "", "")

          fun name(block: () -> String) {
              this.name = block()
          }

          fun age(block: () -> Int) {
              this.age = block()
          }

          fun address(block: AddressBuilder.() -> Unit) {
              this.address = AddressBuilder().apply(block).build()
          }

          fun build(): Person {
              return Person(name, age, address)
          }
      }

      fun person(block: PersonBuilder.() -> Unit): Person {
          return PersonBuilder().apply(block).build()
      }


      val person = person {
          name { "Guowei Lv" }
          age { 18 }
          address {
              postalCode { "00890" }
              street { "Hamentie" }
              city { "Helsinki" }

          }
      }

      print(person)
    #+END_SRC

    #+RESULTS:
    : Person(name=Guowei Lv, age=18, address=Address(postalCode=00890, city=Helsinki, street=Hamentie))res9: kotlin.String = >>> 

*** Dagger2
    #+HEADERS: :classname HelloWorld 
    #+begin_src java  :results output :exports both
      public interface Provider<T> {
          T get();
      }

      public final class Foo {
          @Inject Foo() {}
      }

      @Generated
      public final class Foo_Factory implements Provider<Foo> {
          @Override Foo get() {
              return new Foo();
          }
      }

      final class Bar {
          @Inject Bar(Foo foo) {}
      }

      @Generated
      public final class Bar_Factory implements Provider<Bar> {
          private final Provider<Foo> fooProvider;

          public Bar_Factory(Provider<Foo> fooProvider) {
              this.fooProvider = fooProvider;
          }

          @Override Bar get() {
              return new Bar(fooProvider.get());
          }
      }

      final class Baz {
          static Baz create(Bar bar) {
              return /* */;
          }
      }

      @Module
      final class MyModule {
          @Provides static Baz provideBaz(Bar bar) {
              return Baz.create();
          }
      }

      @Generated
      public final class Baz_Factory implements Provider<Baz> {
          private final Provider<Bar> barProvider;

          public Baz_Factory(Provider<Bar> barProvider) {
              this.barProvider = barProvider;
          }

          @Override Baz get() {
              return MyModule.provideBaz(barProvider.get());
          }
      }

      @Component(modules = MyModule.class)
      interface MyComponent {
          Baz baz();
      }

      @Generated
      final class DaggerMyComponent implements MyComponent {
          private final Provider<Foo> fooProvider;
          private final Provider<Bar> barProvider;
          private final Provider<Baz> bazProvider;

          DaggerMyComponent() {
              this.fooProvider = new Foo_Factory();
              this.barProvider = new Bar_Factory(fooProvider);
              this.bazProvider = new Baz_Factory(barProvider);
          }

          @Override public Baz baz() {
              return bazProvider.get();
          }
      }
    #+end_src

    #+RESULTS:
    : Hello, World

**** Project 10
     #+BEGIN_SRC cpp
       #include <iostream>
       #include <string>

       using namespace std;

       class Human {
       public:
         Human();
         Human(int age, int salary, string name);
         Human(const Human &other);
         void eat();
         void sleep();
         string getName();
         int getAge();
         int getSalary();

       private:
         string name;
         int age;
         int salary;
       };

       Human::Human() {
         name = "Anonymous";
         age = 0;
         salary = 0;
       }

       Human::Human(int age, int salary, string name) {
         this -> age = age;
         this -> salary = salary;
         this -> name = name;
       }

       // Copy constructor
       Human::Human(const Human &other) {
         cout << "Copy constructor called" << "\n";

         name = other.name;
         salary = other.salary;
         age = other.age;
       }

       void Human::eat() {
         cout << "Eating" << "\n";
       }

       void Human::sleep() {
         cout << "Sleeping" << "\n";
       }

       int Human::getAge() {
         return age;
       }

       string Human::getName() {
         return name;
       }

       int Human::getSalary() {
         return salary;
       }

       void showHuman(Human human) {
         cout << human.getName() << "\n";
       }

       int main(int argc, char *argv[])
       {
         Human h;
         cout << h.getName() << "\n";
         cout << h.getAge() << "\n";
         cout << h.getSalary() << "\n";

         Human h2(30, 1000, "Guowei");
         cout << h2.getName() << "\n";
         cout << h2.getAge() << "\n";
         cout << h2.getSalary() << "\n";

         Human h3 = h2;
         Human h4(h3);

         showHuman(h4);
         return 0;
       }
     #+END_SRC

     #+RESULTS:
     | Anonymous |             |        |
     | 0         |             |        |
     | 0         |             |        |
     | Guowei    |             |        |
     | 30        |             |        |
     | 1000      |             |        |
     | Copy      | constructor | called |
     | Copy      | constructor | called |
     | Copy      | constructor | called |
     | Guowei    |             |        |

***** Describing locations.
      #+BEGIN_SRC lisp :results raw
        (defparameter *nodes* '((living-room
                                 (you are in the living room. a wizard is snoring loudly on the couch.))
                                (garden
                                 (you are in the beautiful garden. there is a well in front of you.))
                                (attic
                                 (you are in the attic. there is a giant welding torch in the corner.))))
        (defun describe-location (location nodes)
          (cadr (assoc location nodes)))
      #+END_SRC

      #+RESULTS:
      DESCRIBE-LOCATION
      DESCRIBE-LOCATION
      DESCRIBE-LOCATION

      *nodes* is called association list, or /alist/ in short.
      #+BEGIN_SRC lisp :results raw
        (assoc 'garden *nodes*)
      #+END_SRC

      #+RESULTS:
      (GARDEN (YOU ARE IN THE BEAUTIFUL GARDEN. THERE IS A WELL IN FRONT OF YOU.))
      (GARDEN (YOU ARE IN THE BEAUTIFUL GARDEN. THERE IS A WELL IN FRONT OF YOU.))
      (GARDEN (YOU ARE IN THE BEAUTIFUL GARDEN. THERE IS A WELL IN FRONT OF YOU.))
***** Describing paths.
      #+BEGIN_SRC lisp :results raw
        (defparameter *edges* '((living-room
                                 (garden west door)
                                 (attic upstairs ladder))
                                (garden
                                 (living-room east door))
                                (attic
                                 (living-room downstairs ladder))))

        (defun describe-path (edge)
          `(there is a ,(caddr edge) going ,(cadr edge) from here.))

        (defun describe-paths (location edges)
          (apply #'append (mapcar #'describe-path (cdr (assoc location edges)))))

        (describe-paths 'living-room *edges*)
      #+END_SRC

      #+RESULTS:
      (THERE IS A DOOR GOING WEST FROM HERE. THERE IS A LADDER GOING UPSTAIRS FROM
       HERE.)
      (THERE IS A DOOR GOING WEST FROM HERE. THERE IS A LADDER GOING UPSTAIRS FROM
       HERE.)
      (THERE IS A DOOR GOING WEST FROM HERE. THERE IS A LADDER GOING UPSTAIRS FROM
       HERE.)
***** Describing Objects at Specific Location
      #+BEGIN_SRC lisp :results raw
        (defparameter *objects* '(whisky bucket frog chain))

        (defparameter *object-locations* '((whisky living-room)
                                           (bucket living-room)
                                           (chain garden)
                                           (frog garden)))

        (defun objects-at (loc objs obj-locs)
          (labels ((at-loc-p (obj)
                     (eq (cadr (assoc obj obj-locs)) loc)))
            (remove-if-not #'at-loc-p objs)))

        (objects-at 'living-room *objects* *object-locations*)
      #+END_SRC

      #+RESULTS:
      (WHISKY BUCKET)
      (WHISKY BUCKET)
      (WHISKY BUCKET)
***** Describing Visible Objects
      #+BEGIN_SRC lisp :results raw
        (defun describe-objects (loc objs obj-loc)
          (labels ((describe-obj (obj)
                     `(you see a ,obj on the floor.)))
            (apply #'append (mapcar #'describe-obj
                                    (objects-at loc objs obj-loc)))))

        (describe-objects 'living-room *objects* *object-locations*)
      #+END_SRC

      #+RESULTS:
      (YOU SEE A WHISKY ON THE FLOOR. YOU SEE A BUCKET ON THE FLOOR.)
      (YOU SEE A WHISKY ON THE FLOOR. YOU SEE A BUCKET ON THE FLOOR.)
      (YOU SEE A WHISKY ON THE FLOOR. YOU SEE A BUCKET ON THE FLOOR.)
***** Describing It All
      #+BEGIN_SRC lisp :results raw
        (defparameter *location* 'living-room)

        (defun look ()
          (append (describe-location *location* *nodes*)
                  (describe-paths *location* *edges*)
                  (describe-objects *location* *objects* *object-locations*)))

        (look)
      #+END_SRC

      #+RESULTS:
      (YOU ARE IN THE LIVING ROOM. A WIZARD IS SNORING LOUDLY ON THE COUCH. THERE IS
       A DOOR GOING WEST FROM HERE. THERE IS A LADDER GOING UPSTAIRS FROM HERE. YOU
       SEE A WHISKY ON THE FLOOR. YOU SEE A BUCKET ON THE FLOOR.)
      (YOU ARE IN THE LIVING ROOM. A WIZARD IS SNORING LOUDLY ON THE COUCH. THERE IS
       A DOOR GOING WEST FROM HERE. THERE IS A LADDER GOING UPSTAIRS FROM HERE. YOU
       SEE A WHISKY ON THE FLOOR. YOU SEE A BUCKET ON THE FLOOR.)
      (YOU ARE IN THE LIVING ROOM. A WIZARD IS SNORING LOUDLY ON THE COUCH. THERE IS
       A DOOR GOING WEST FROM HERE. THERE IS A LADDER GOING UPSTAIRS FROM HERE. YOU
       SEE A WHISKY ON THE FLOOR. YOU SEE A BUCKET ON THE FLOOR.)

       Walking Around in Our World
      #+BEGIN_SRC lisp :results raw
        (defun walk (direction)
          (let ((next (find direction
                            (cdr (assoc *location* *edges*))
                            :key #'cadr)))
            (if next
                (progn (setf *location* (car next))
                       (look))
                '(you cannot go that way.))))
      #+END_SRC

      #+RESULTS:
      WALK
      WALK
      WALK
***** Picking Up Objects
      #+BEGIN_SRC lisp :results raw
        (defun pickup (object)
          (cond ((member object
                         (objects-at *location* *objects* *object-locations*))
                 (push (list object 'body) *object-locations*)
                 `(you are now carrying the ,object))
                (t '(you cannot get that.))))
      #+END_SRC

      #+RESULTS:
      PICKUP
      PICKUP
      PICKUP
***** Checking Our Inventory
      #+BEGIN_SRC lisp :results raw
        (defun inventory ()
          (cons 'items- (objects-at 'body *objects* *object-locations*)))
      #+END_SRC

      #+RESULTS:
      INVENTORY
      INVENTORY
      INVENTORY
***** New Game Interface
      #+BEGIN_SRC lisp :results raw
        (defun game-read ()
          (let ((cmd (read-from-string
                      (concatenate 'string "(" (read-line) ")"))))
            (flet ((quote-it (x)
                     (list 'quote x)))
              (cons (car cmd) (mapcar #'quote-it (cdr cmd))))))

        (defparameter *allowed-commands* '(look walk pickup inventory))

        (defun game-eval (sexp)
          (if (member (car sexp) *allowed-commands*)
              (eval sexp)
              '(i do not know that command.)))

        (defun tweak-text (lst caps lit)
          (when lst
            (let ((item (car lst))
                  (rest (cdr lst)))
              (cond ((eq item #\space) (cons item (tweak-text rest caps lit)))
                    ((member item '(#\! #\? #\.)) (cons item (tweak-text rest t lit)))
                    ((eq item #\") (tweak-text rest caps (not lit)))
                    (lit (cons item (tweak-text nil lit)))
                    ((or caps lit) (cons (char-upcase item) (tweak-text rest nil lit)))
                    (t (cons (char-downcase item) (tweak-text rest nil nil)))))))

        (defun game-print (lst)
          (princ (coerce (tweak-text (coerce (string-trim "() "
                                                          (prin1-to-string lst))
                                             'list)
                                     t
                                     nil)
                         'string))
          (fresh-line))

        (defun game-repl ()
          (let ((cmd (game-read)))
            (unless (eq (car cmd) 'quit)
              (game-print (game-eval cmd))
              (game-repl))))
      #+END_SRC

      #+RESULTS:
      GAME-REPL
      GAME-REPL
      GAME-REPL

      #+BEGIN_SRC lisp :results raw
      #+END_SRC

      #+RESULTS:
      NIL
      NIL

      #+BEGIN_SRC lisp :results raw
      #+END_SRC

      #+RESULTS:
      NIL
      NIL

      #+BEGIN_SRC lisp :results raw
      #+END_SRC

      #+RESULTS:
      NIL
      NIL
**** 2.1
     #+BEGIN_SRC C
       #include <stdio.h>
       #include <string.h>

       typedef unsigned char *byte_pointer;

       void show_bytes(byte_pointer start, size_t len)
       {
         size_t i;
         for (i = 0; i < len; ++i) {
           printf(" %.2x", start[i]);
         }
         printf("\n");
       }

       void show_int(int x)
       {
         show_bytes((byte_pointer) &x, sizeof(int));
       }

       void show_float(float x)
       {
         show_bytes((byte_pointer) &x, sizeof(float));
       }

       void show_pointer(void *x)
       {
         show_bytes((byte_pointer) &x, sizeof(void *));
       }

       int main(int argc, char *argv[])
       {
         int val = 0x87654321;
         //show_int(val);
         byte_pointer valp = (byte_pointer) &val;
         show_bytes(valp, 1);
         show_bytes(valp, 2);
         show_bytes(valp, 3);

         const char *s = "abcdef";
         show_bytes((byte_pointer) s, strlen(s));

         return 0;
       }

     #+END_SRC

     #+RESULTS:
     | 21 |    |    |    |    |    |
     | 21 | 43 |    |    |    |    |
     | 21 | 43 | 65 |    |    |    |
     | 61 | 62 | 63 | 64 | 65 | 66 |

**** Binary Search
#+begin_src python :results output

  def binary_search(list, item):
      low = 0
      high = len(list) - 1
      while (low <= high):
          mid = (low + high) // 2
          if (list[mid] == item):
              return mid
          else:
              if (list[mid] > item):
                  high = mid - 1
              else:
                  low = mid + 1
      return None

  print(binary_search([1, 2, 3, 4, 5], 3))
#+end_src

#+RESULTS:
: 2
